### Import packages

In [1]:
import sqlite3
import pandas as pd

### Connect to database - there are two relevant tables ('author' and 'books')

In [8]:
conn = sqlite3.connect('amazon_db.db')
c = conn.cursor()

In [9]:
c.execute("""SELECT * FROM books
LIMIT 5; """)

In [7]:
c.description

(('books', None, None, None, None, None, None),
 ('num_copies', None, None, None, None, None, None))

In [10]:
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

                                books num_copies
0         A Elephant Ate Under A Fish    4226324
1         A Boy Jumped Outside A Lake    4048899
2       One Man Hopped Under The Tree     774329
3  A Person Threw Behind The Notebook    1359606
4     The Tree Ran Through A Mountain    4703380

In [11]:
c.execute("""SELECT * FROM author
LIMIT 5; """);

In [12]:
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

             author                                book
0      David Taylor         A Guy Dove Outside The Desk
1    Sidney Osborne        A Fish Hopped Through A Lake
2     Robert Martin     The Woman Winced Outside A Desk
3      Greg Simpson  A Banana Winced Outside The Banana
4  Edgar Williamson      A Person Ate Behind The Potato

### Use SQL to answer the following questions:

1. How many rows are in the 'author' table? 

2. How many authors have the first name 'David'?  

3. How many books did each author write? 

4. Use both the author table and books table to answer: how many copies were sold by authors named David 


    a. how many copies for each of the Davids
    
    
    b. how many copies in total for all Davids

In [16]:
c.execute("""SELECT count() FROM author;""");

In [17]:
print(c.fetchall())

[(100000,)]

In [18]:
c.execute("""SELECT count() 
             FROM author 
             WHERE author LIKE 'David%'""")

In [20]:
print(c.fetchall())

[(1335,)]

In [21]:
c.execute("""SELECT COUNT(DISTINCT(author)) 
             FROM author 
             WHERE author LIKE 'David%'""")
print(c.fetchall())

[(1024,)]

In [25]:
c.execute("""SELECT author, COUNT(*) n
             FROM author
             WHERE author LIKE 'David%'
             GROUP BY author 
             HAVING n>1""")
print(c.fetchall())

[('David Adams', 3), ('David Allen', 2), ('David Alvarez', 2), ('David Anderson', 3), ('David Arnold', 2), ('David Baca', 2), ('David Bailey', 2), ('David Baron', 2), ('David Beck', 2), ('David Bell', 2), ('David Berk', 2), ('David Blair', 2), ('David Bowman', 2), ('David Brewer', 2), ('David Brown', 8), ('David Bunch', 2), ('David Burdick', 2), ('David Byrd', 2), ('David Caldwell', 2), ('David Campbell', 2), ('David Carlson', 2), ('David Carter', 2), ('David Castillo', 4), ('David Castro', 2), ('David Chapman', 3), ('David Clark', 2), ('David Collins', 4), ('David Colon', 2), ('David Cooper', 3), ('David Cox', 3), ('David Cruz', 3), ('David Curry', 2), ('David Davis', 2), ('David Day', 2), ('David Diamond', 2), ('David Diaz', 2), ('David Do', 2), ('David Douglas', 2), ('David Edwards', 2), ('David Ellis', 2), ('David Erickson', 3), ('David Evans', 2), ('David Fanning', 2), ('David Farmer', 3), ('David Ferguson', 2), ('David Fish', 2), ('David Fletcher', 2), ('David Fontenot', 2), ('David Fowler', 2), ('David Garcia', 5), ('David Gardner', 5), ('David Garrett', 2), ('David Garrison', 3), ('David Geyer', 2), ('David Gonzales', 3), ('David Gonzalez', 3), ('David Good', 2), ('David Graham', 2), ('David Grant', 2), ('David Gray', 2), ('David Gross', 3), ('David Gutierrez', 2), ('David Guy', 2), ('David Hamilton', 3), ('David Hammond', 2), ('David Hancock', 2), ('David Harris', 5), ('David Hayes', 3), ('David Haynes', 2), ('David Henkel', 2), ('David Hernandez', 3), ('David Hicks', 2), ('David Hoffman', 2), ('David Howard', 3), ('David Hunt', 2), ('David Hussey', 2), ('David Jackson', 2), ('David James', 3), ('David Johnson', 9), ('David Jolly', 2), ('David Jones', 8), ('David Jordan', 3), ('David Jordon', 2), ('David Kane', 2), ('David Kelly', 2), ('David Kennedy', 3), ('David King', 3), ('David Lee', 2), ('David Lewis', 3), ('David Little', 2), ('David Lopez', 3), ('David Marin', 2), ('David Marshall', 4), ('David Martin', 5), ('David Martinez', 7), ('David Mcbride', 3), ('David Mcgee', 3), ('David Mcguire', 2), ('David Mckinnon', 2), ('David Medina', 3), ('David Miller', 5), ('David Mills', 2), ('David Mitchell', 4), ('David Moore', 7), ('David Morgan', 3), ('David Morrison', 2), ('David Murray', 3), ('David Nelson', 6), ('David Nolan', 2), ('David Oconnell', 2), ('David Ortiz', 2), ('David Park', 2), ('David Parker', 3), ('David Payne', 3), ('David Perez', 2), ('David Peters', 3), ('David Porter', 2), ('David Powell', 2), ('David Powers', 2), ('David Price', 3), ('David Ramirez', 2), ('David Ray', 3), ('David Reyes', 2), ('David Reynolds', 2), ('David Rhodes', 2), ('David Richards', 2), ('David Richardson', 3), ('David Riley', 2), ('David Ritter', 2), ('David Rivera', 4), ('David Roberts', 3), ('David Robinson', 2), ('David Rodriguez', 4), ('David Rogers', 3), ('David Romero', 2), ('David Rose', 2), ('David Sanchez', 3), ('David Sawyer', 2), ('David Scott', 3), ('David Simon', 2), ('David Smith', 15), ('David Spencer', 2), ('David Stephens', 2), ('David Stevens', 2), ('David Swanson', 3), ('David Tanner', 2), ('David Taylor', 5), ('David Temple', 2), ('David Thomas', 4), ('David Thompson', 4), ('David Torres', 2), ('David Vasquez', 2), ('David Walker', 3), ('David Walter', 4), ('David Walton', 2), ('David Ward', 4), ('David Warren', 2), ('David Washington', 2), ('David Watson', 3), ('David Watts', 2), ('David Wells', 3), ('David Wheeler', 2), ('David White', 7), ('David Williams', 9), ('David Willis', 2), ('David Wilson', 5), ('David Wood', 2), ('David Wright', 3), ('David Young', 3)]